haliwt/Drv8302_mkv46f256vlh16_servo/main.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause  MKV46F256VLH16
 */

/*System includes.*/
#include <stdio.h>
#include "amclib_FP.h"
#include "mlib_FP.h"
#include "gflib_FP.h"
#include "gdflib_FP.h"
#include "gmclib_FP.h"

/* Kernel includes. */
//#include "FreeRTOS.h"
//#include "task.h"
//#include "queue.h"
//#include "timers.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"

#include "fsl_debug_console.h"

#include "fsl_pwm.h"
#include "pin_mux.h"
#include "fsl_xbara.h"
#include "led.h"
#include "key.h"
#include "bldc.h"
#include "adc.h"
#include "pollingusart.h"
#include "output.h"
#include "input.h"
//#include "usart_edma_rb.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define MAX_LOG_LENGTH 20


output_t recoder_number;



/*
**********************************************************************************************************
											变量声明
**********************************************************************************************************
*/


typedef struct Msg
{
	uint8_t  ucMessageID;
	uint8_t  usData[10];
	
}MSG_T;

MSG_T   g_tMsg; /* 定义一个结构体用于消息队列 */




/*******************************************************************************
 *
 * Code
 *
 * @brief Main function
 *
******************************************************************************/
int main(void)
{

 
    uint8_t printx1[]="Dir = Dir is OK !!!! CW \r\n";
    uint8_t printx2[]="Dir = - Dir is OK #### CCW \r\n";
 
	//uint16_t sampleMask;
     uint8_t ucKeyCode=0,abc_s=0,dirvalue=0;
     uint8_t start_s =0,motor,dir_s =0,i;
     volatile uint8_t power_on = 0;
   

    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    
   
    LED_Init();
    KEY_Init();
    DelayInit();
    HALL_Init();
    
    SD315AI_SO12_Input_Init();
    
    
    OUTPUT_Fucntion_Init();
    ADC_CADC_Init();
    ABC_POWER_OUTPUT_Init();
    /* Set the PWM Fault inputs to a low value */
    PWM_BLDC_Init();
    USART_POLLING_Init();
     
   while(1)
   {

          ucKeyCode = KEY_Scan(0);
          
          if(motor == 1 )
           {
               if(power_on == 0)
               {
                   printf("************************************************************\r \n");
                   power_on ++ ;
                  
                   if(dirvalue==0)  
                   {
                        
                  
                         
                        uwStep = HallSensor_GetPinState();
                        switch(uwStep)
                        {
                        case 5 :
                          for(i = 0; i<3;i++)
                          {
                              
                              if(i == 0)
                                PWM_Duty = 60;
                              else if(i==1)PWM_Duty = 70;
                              else if(i==2)PWM_Duty = 80;
                              uwStep = 5;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 4;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 6 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 2 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 3 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 1 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                          }
                          break;
                        case 4:
                          for(i = 0;i<3 ;i++)
                          {
                           if(i == 0)
                               PWM_Duty = 60;
                              else if(i==1)PWM_Duty = 70;
                              else if(i==2)PWM_Duty = 80;
                            uwStep = 4;
                            HALLSensor_Detected_BLDC();
                              DelayMs(8);
                            uwStep = 6;
                            HALLSensor_Detected_BLDC();
                              DelayMs(8);
                            uwStep = 2 ;
                            HALLSensor_Detected_BLDC();
                              DelayMs(8);
                            uwStep = 3 ;
                            HALLSensor_Detected_BLDC();
                            DelayMs(8);
                            uwStep = 1 ;
                            HALLSensor_Detected_BLDC();
                              DelayMs(8);
                            uwStep = 5 ;
                            HALLSensor_Detected_BLDC();
                        
                          }
                         break;
                          case 6:
                            for(i = 0;i<3 ;i++)
                          {
                              
                              if(i == 0)
                                PWM_Duty = 60;
                              else if(i==1)PWM_Duty = 70;
                              else if(i==2)PWM_Duty = 80;
                              uwStep = 6;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 2;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 3 ;
                              HALLSensor_Detected_BLDC();
                               DelayMs(8);
                              uwStep = 1 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 5 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 4 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                          }
                         break;
                         case 2:
                           for(i = 0;i<3 ;i++)
                          {
                            if(i == 0)
                                PWM_Duty = 60;
                              else if(i==1)PWM_Duty = 70;
                              else if(i==2)PWM_Duty = 80;
                            
                              uwStep = 2;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 3;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 1 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 5 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 4 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 6 ;
                              HALLSensor_Detected_BLDC();
                 DelayMs(8);
                          }
                         break;
                         case 3:
                           for(i = 0;i<3 ;i++)
                          {
                              if(i == 0)
                                PWM_Duty = 60;
                              else if(i==1)PWM_Duty = 70;
                              else if(i==2)PWM_Duty = 80;
                              uwStep = 3;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 1;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 5 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 4 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 6 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                              uwStep = 2 ;
                              HALLSensor_Detected_BLDC();
                              DelayMs(8);
                          }
                         break;
                         case 1:
                            for(i = 0;i<3 ;i++)
                              {
                                  if(i == 0)
                                    PWM_Duty = 60;
                                  else if(i==1)PWM_Duty = 70;
                                  else if(i==2)PWM_Duty = 80;
                                
