haliwt/Drv8302_mkv46f256vlh16_servo/main.c
                                  uwStep = 1;
                                  HALLSensor_Detected_BLDC();
                                  DelayMs(8);
                                  uwStep = 5;
                                  HALLSensor_Detected_BLDC();
                                  DelayMs(8);
                                  uwStep = 4 ;
                                  HALLSensor_Detected_BLDC();
                                  DelayMs(8);
                                  uwStep = 6 ;
                                  HALLSensor_Detected_BLDC();
                                  DelayMs(8);
                                  uwStep = 2 ;
                                  HALLSensor_Detected_BLDC();
                                  DelayMs(8);
                                  uwStep = 3 ;
                                  HALLSensor_Detected_BLDC();
                                  DelayMs(8);
                              }
                          
                         break;
                        }
                          
                     printf("Dir = %d\r \n",dirvalue); 
                     printf("PWM_Duty= %d\r \n",PWM_Duty);
                         
                 }
                 else 
                 {
                 
                 
                 }
               }
              else 
                {
                  
                  PWM_Duty=20;
                  uwStep = HallSensor_GetPinState();
                                 
                  HALLSensor_Detected_BLDC();
                  printf("PWM_Duty= %d\r \n",PWM_Duty);
                 
                }
             }
          
          else
          {
              PMW_AllClose_ABC_Channel();
          
          }
      
   
           /*Check U phase*/
          if(GPIO_PinRead(SD315AI_SO1_A_GPIO,SD315AI_SO1_A_PIN)==1 ||GPIO_PinRead(SD315AI_SO2_A_GPIO,SD315AI_SO1_A_PIN)==1)
          {
               GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,1);//SD315_VL_A_OUTPUT=0;
           
          }
          else
          {
              GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,0);//SD315_VL_A_OUTPUT=0;

          }
          /*Check V phase*/
          if(GPIO_PinRead(SD315AI_SO1_B_GPIO,SD315AI_SO1_B_PIN)== 1 ||GPIO_PinRead(SD315AI_SO2_B_GPIO,SD315AI_SO2_B_PIN)== 1)
          {
               
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,1);//SD315_VL_B_OUTPUT=0;
            

          }
          else
          {
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,0);//SD315_VL_B_OUTPUT=0;
          }
          /*Check W phase*/
          if(GPIO_PinRead(SD315AI_SO1_C_GPIO,SD315AI_SO1_C_PIN)== 1 || GPIO_PinRead(SD315AI_SO2_C_GPIO,SD315AI_SO2_C_PIN)== 1)
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,1);
               
          }
          else
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,0);
          }
		
	    
       

      /*处理接收到的按键功能*/  
		if(ucKeyCode !=KEY_UP) 
		{
           switch(ucKeyCode)
            { 
                 
                  case ABC_POWER_PRES :
                     PRINTF("ABC_PRES key  \r\n");
                     abc_s ++;
                    if(abc_s == 1)
				    {
                       A_POWER_OUTPUT =1;
                       power_on = 0;
                 
                     
                     }
				     else 
				     {
                            A_POWER_OUTPUT =0; //shut down
                            power_on = 1;
                            abc_s =0;
                        
				     }
                      
				  	break;

				 case START_PRES:
                   PRINTF("START_PRES key \r\n");
				    start_s ++;
		          if( start_s== 1)
		          {
                      motor  = 1;
                      power_on = 0;
                     printf("motor is one \n");
                    
    			   }
				  else 
				  {
                      motor = 0;
                      power_on = 1;
					 start_s =0;
					 
					 printf("START KEY IS STOP\n");
				  }
                 
				  break;
				  
				 case DIR_PRES: //3

			       dir_s ++ ;
	  			 if(dir_s == 1)
	   			 {
                         Dir=1;
                         power_on = 0;
				  }
				 else 
				   {
                      
                      //dirvalue =0; //逆时针旋转
                        Dir = 0;
					  printf(" dir is  =0 \r\n");
				   }
			
           		break;
            default :
              
      
              break;
			
        }
        
	}
   }

}
/******************************************************************************
 *
 * Function Name:BARKE_KEY_IRQ_HANDLER(void)
 * Function Active: Interrpt brake input key 
 * @brief Interrupt service fuction of switch.
 *
 * This function toggles the LED
 *
******************************************************************************/
#if 1
void BARKE_KEY_IRQ_HANDLER(void )//void BOARD_BRAKE_IRQ_HANDLER(void)
{
  
    /* Clear external interrupt flag. */
    GPIO_PortClearInterruptFlags(BRAKE_KEY_GPIO, 1U << BRAKE_KEY_GPIO_PIN );
    /* Change state of button. */
    A_POWER_OUTPUT =1;
	recoder_number.break_f =1;
	PRINTF("interrupte has happed  \r\n");
	                  
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}
#endif 
/*******************************************************************************************/

#if 0
/******************************************************************************************************
*	函 数 名: vTaskTaskUSART
*	功能说明: 接口消息处理。
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 1  (数值越小优先级越低，最低优先级)
********************************************************************************************************/
static void vTaskUSART(void *pvParameters)
{

  uint8_t vTasktx[]="vTaskUSART-1 \r\n";
  // TickType_t xLastWakeTime;
 // const TickType_t xFrequency = 300;
  uint8_t i,ch;
  MSG_T *ptMsg;
 
