haliwt/Drv8302_mkv46f256vlh16_servo/main.c
  const TickType_t xMaxBlockTime = pdMS_TO_TICKS(300); /* 设置最大等待时间为5ms */
  /* 初始化结构体指针 */
	ptMsg = &g_tMsg;
	
	/* 初始化数组 */
	ptMsg->ucMessageID = 0;
    for(i=0;i<4;i++)
        ch =ptMsg->usData[i];

  while(1)
    {
    
      //printf("vTaskUSART-1 \r\n");
       UART_WriteBlocking(DEMO_UART,vTasktx,sizeof(vTasktx)-1);
       UART_ReadBlocking(DEMO_UART, ptMsg->usData, 4);
      
        for(i=0;i<4;i++)
		{
          ch=ptMsg->usData[i];
		  printf("ptMsg->usData[i]= %#x \r\n",ch);

		}
      
        if(ptMsg->usData[0] == 0x01) //'1' = 0x31
         {
           
		      xTaskNotify(xHandleTaskCOTL,      /* 目标任务 */
								ptMsg->usData[2],              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
               printf("Send to xHanderCONT is OK \n");
                for(i=0;i<10;i++)
                 ch =ptMsg->usData[i];
         }
        if(ptMsg->usData[0]== 0x02)
        {
           
	      xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
							ptMsg->usData[2],              /* 发送数据 */
							eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
        }
		//taskYIELD();//vTaskDelay(xMaxBlockTime);
	    vTaskDelay(xMaxBlockTime);// vTaskDelayUntil(&xLastWakeTime, xFrequency);
    }
}
/*********************************************************************************************************
*
*	函 数 名: vTaskSUBJ
*	功能说明: 接收物理按键和数字按键的命令
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 2  
*
*********************************************************************************************************/
static void vTaskSUBJ(void *pvParameters)
{
     
     uint8_t vTasktx1[]="ABC_= 1 @@@@~~~@@@\r\n";
     uint8_t vTasktx2[]="ABC_= 0 ~~~~~~~~~\r\n";

      TickType_t xLastWakeTime;
	
	  const TickType_t xFrequency = 200;
      xLastWakeTime = xTaskGetTickCount();
     
     uint8_t abc_s=0,door_s=0,wipers_s=0;
     uint32_t vlSubj;
     uint32_t ucConKeyValue;
	 BaseType_t xResult;
	const TickType_t xMaxBlockTime = pdMS_TO_TICKS(200); /* 设置最大等待时间为5ms */

	while(1)
    {
          printf("vTaskSUBJ-2 \r\n");
		
		  xResult = xTaskNotifyWait(0x00000000,      
						           0xFFFFFFFF,      
						           &vlSubj,        /* 存储ulNotifiedValue在ulvalue中 */
						           xMaxBlockTime);  /* 最大延迟时间 */
          
		  
		if( xResult == pdPASS )
		{
			
             ucConKeyValue = vlSubj;
             printf("vTaskSUBJ vlSubj = %#x\r\n", ucConKeyValue);
             /*******************ABC_POWER_F*************************/
             #if 1
             if(ucConKeyValue==0x01)
			 {
                 
                  //abc_s ++ ;
                 if(abc_s == 0)
                 {
                   A_POWER_OUTPUT =0;
                   abc_s ++ ;
                  //printf("ABC_= 1 @@@@~~~@@@\r\n");
                  UART_WriteBlocking(DEMO_UART,vTasktx1,sizeof(vTasktx1)-1);
		     
			     }
			     else 
                 {
                   abc_s = 0;
                   A_POWER_OUTPUT =1;
                  
                  //printf("ABC_ = 0 @@@@@@@~~~\r\n"); 
                   UART_WriteBlocking(DEMO_UART,vTasktx2,sizeof(vTasktx2)-1);
                 }
		     }
             #endif 
			 /*******************Door_F*************************/
			 if(ucConKeyValue==0x08)
			 {
               
                door_s ++ ;
                if(door_s ==1)
                {
                  DOOR_OUTPUT =1;//door open
                  printf("DOOR_OUTPUT = 1 @@@@@@@\r\n");  
		        }
                else
                {
                  door_s =0;
                  DOOR_OUTPUT =0;//door open
                  printf("DOOR_OUTPUT = 0 ~~~~~~~\r\n");  
                }
		     }
			 /*******************WIPERS_F***************************/
             if(ucConKeyValue == 0x09)
	         {
	  			
	  			 wipers_s ++ ;
                 if(wipers_s == 1)
                 {
                   WIPER_OUTPUT_1 = 1;
                   printf("WIPERS  = 1 @@@@~~~~\r\n");   
                 }
			     else if(wipers_s == 2)
                 {
                   wipers_s = 0;
                   WIPER_OUTPUT_1 = 2;   
                   printf("WIPERS  = 2 ~~~~@@@@\r\n");
                 }
			 
			    else if(wipers_s == 3)
                 {
                     WIPER_OUTPUT_1 = 3;   
                
                    printf("WIPERS  = 3 @@@~~~~@@@\r\n");
                  }
                else
                 {
                     wipers_s =0;
                      WIPER_OUTPUT_1 = 0;   
                    
                      printf("WIPERS  = 0 @@@~~~~@@@~~~~\r\n");
                 }
             }
		     /*******************AIR_F***************************/   
              if(ucConKeyValue == 0x12)
			 {
                 AIR_OUTPUT = 1;
                
				printf("AIR  = 1 ~~@@@~~\r\n");
			 }
              if(ucConKeyValue == 0x13)
			 {
                 AIR_OUTPUT = 0;
                
				printf("AIR  = 0 ~~@@@~~@@@~~~~@@@\r\n");
			 }
        }
		else
		{
			/* 3?ê± */
			LED1=!LED1;
			
		}

    vTaskDelayUntil(&xLastWakeTime, xFrequency); // vTaskDelay(xMaxBlockTime); 
	}
}
/*********************************************************************************************************
*	函 数 名: vTaskBLDC
*	功能说明: 使用函数xQueueReceive接收任务vTaskTaskUserIF发送的消息队列数据(xQueue2)	
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 3  
*********************************************************************************************************/
static void vTaskBLDC(void *pvParameters)
{
    uint8_t txbuff[]="vTaskBLDC 3\r\n";
    uint32_t ucValue;
   
//	TickType_t xLastWakeTime;
	
//	const TickType_t xFrequency = 100;
 //  xLastWakeTime = xTaskGetTickCount();
    volatile uint16_t pwm_f=0;
	uint16_t sampleMask;
	BaseType_t xResult;
   
    const TickType_t xMaxBlockTime = pdMS_TO_TICKS(5); /* 设置最大等待时间为300ms */
	uint32_t ucConValue;
    uint16_t dirvalue;
	uint8_t vTasktx1[]="BLDC receive success!!";
   
    uint8_t vBLDCtx2[] = "Motor Run is OK !!!!";
    uint8_t printx1[]="Dir = Dir is OK !!!! CW \r\n";
    uint8_t printx2[]="Dir = - Dir is OK #### CCW \r\n";
	while(1)
    {       
        
