haliwt/Drv8302_mkv46f256vlh16_servo/main.c
        //printf("vTaskBLDC-2 \r\n");  
        UART_WriteBlocking(DEMO_UART,txbuff,sizeof(txbuff)-1);
        xResult = xTaskNotifyWait(0x00000000,      
						          0xFFFFFFFF,      
						          &ucConValue,        /* 存储ulNotifiedValue在ulvalue中 */
						          xMaxBlockTime);  /* 最大延迟时间 */
	  if(xResult == pdPASS)
		{
			/* 接收数据成功 */
          //printf("vTaskBLDC ConmessageID = %#x\r\n",ucConValue );
           UART_WriteBlocking(DEMO_UART,vTasktx1,sizeof(vTasktx1)-1);
		  ucValue = ucConValue ;
		}
		else
		{
			/* 超时 */
          LED2= !LED2;
		}
     #if 0 
      if(ucValue == 0x01)
      {
         A_POWER_OUTPUT =1;
		
		 
        // printf("ABC_= 1 @@@@~~~@@@\r\n");
         UART_WriteBlocking(DEMO_UART,vTasktx2,sizeof(vTasktx2)-1);
		 
	  }
	  else if(ucValue == 0x02)
	  {

         A_POWER_OUTPUT =0;
		
		
		//printf("ABC_= 0 ~~~~~~~~~\r\n"); 
         UART_WriteBlocking(DEMO_UART,vTasktx3,sizeof(vTasktx3)-1);
	  }
	  #endif 

		
	  if((ucValue==0xa1)|| (recoder_number.break_f ==1))//刹车
	  {
       
        
           
         taskENTER_CRITICAL(); //进入临界状态
		 PMW_AllClose_ABC_Channel();
         PMW_AllClose_ABC_Channel();
		
		 if(recoder_number.break_f ==1)
		 {
		     A_POWER_OUTPUT =0;
			  
		  }
		 taskEXIT_CRITICAL(); //退出临界状态
		 
		 //printf("Break is OK $$$$$$$$$$$$$\r\n");
        
	  }
	  else if(ucValue==0xa0)  
	  { 
            
            /* 接收数据成功 */
             printf("Motor run = %#x\r\n",ucConValue);
			// printf("Motor Run is OK !!!!\r\n");
             UART_WriteBlocking(DEMO_UART,vBLDCtx2,sizeof(vBLDCtx2)-1);

	       /**********************adjust frequency ****************************/
			{
            
		    CADC_DoSoftwareTriggerConverter(CADC_BASEADDR, kCADC_ConverterA);
	             /* Wait the conversion to be done. */
	         while (kCADC_ConverterAEndOfScanFlag !=
	               (kCADC_ConverterAEndOfScanFlag & CADC_GetStatusFlags(CADC_BASEADDR)))
	        {
	        }

	        /* Read the result value. */
	        if (sampleMask == (sampleMask & CADC_GetSampleReadyStatusFlags(CADC_BASEADDR)))
	        {
              //  pwm_f =(int16_t)CADC_GetSampleResultValue(CADC_BASEADDR, 1U);
		      //   PRINTF("%d\t\t",pwm_f );
	           
			 // DelayMs(100U);
             // pwm_f = (uint16_t)((CADC_GetSampleResultValue(CADC_BASEADDR, 1U))/ 330);
	         // PRINTF("PWM_Duty = %d\r\n",pwm_f);
			 // DelayMs(200U);
	           
            }
            CADC_ClearStatusFlags(CADC_BASEADDR, kCADC_ConverterAEndOfScanFlag);

     	    }

            //pwm_f = (uint16_t)((CADC_GetSampleResultValue(CADC_BASEADDR, 1U))/ 330);
            pwm_f = 50;
           // PRINTF("PWM_Duty = %d\r\n",pwm_f);
            
			if(recoder_number.dir_change == 1) 
            {
                  dirvalue = 1 ;
				 // printf("Dir = Dir is OK !!!! CW \r\n");
				  UART_WriteBlocking(DEMO_UART,printx1,sizeof(printx1)-1);
			}
			else 
			{
			    dirvalue = 0;
				//printf("Dir = - Dir is OK #######\r\n");
				UART_WriteBlocking(DEMO_UART,printx2,sizeof(printx2)-1);
			}
			/***********Motor Run**************/
          
			 uwStep = HallSensor_GetPinState();
        	//PRINTF("ouread = %d \r\n",uwStep);
        	
        	
        	HALLSensor_Detected_BLDC(uwStep,pwm_f,dirvalue); 
           

        }
	
    // vTaskDelayUntil(&xLastWakeTime, xFrequency); // vTaskDelay(xMaxBlockTime);  
     vTaskDelay(xMaxBlockTime); //taskYIELD();////vTaskDelay(xMaxBlockTime); 
      }
 } 

/*********************************************************************************************************
*
*	函 数 名: vTaskCOTL
*	功能说明: 接收物理按键和数字按键的命令
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 4  
*
*********************************************************************************************************/
static void vTaskCOTL(void *pvParameters)
{
   
     uint8_t vTaskCotltx[]= "vTaskCOTL-4";
     uint8_t ucKeyCode=0,abc_s=0,digital_s=0;
     uint8_t start_s =0,door_s = 0,wiper_s=0,air_s=0;
     uint8_t hall_s = 0,wheel_s=0,abc_power_s=0;
     
     TickType_t xLastWakeTime;

    const TickType_t xFrequency = 200;
    xLastWakeTime = xTaskGetTickCount();
    BaseType_t xResult;
	const TickType_t xMaxBlockTime = pdMS_TO_TICKS(100); /* 设置最大等待时间为5ms */
	uint8_t ucControl=0;
	uint32_t rlValue,ulValue;
	

	while(1)
    {
	       //printf("vTaskCOTL-4 \r\n");
          
            UART_WriteBlocking(DEMO_UART,vTaskCotltx,sizeof(vTaskCotltx)-1);
          
          
		   ucKeyCode = KEY_Scan(0);
           /*Check U phase*/
           if(GPIO_PinRead(SD315AI_SO1_A_GPIO,SD315AI_SO1_A_PIN)==1 ||GPIO_PinRead(SD315AI_SO2_A_GPIO,SD315AI_SO1_A_PIN)==1)
          {
               GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,1);//SD315_VL_A_OUTPUT=0;
           
          }
          else
          {
              GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,0);//SD315_VL_A_OUTPUT=0;

          }
          /*Check V phase*/
          if(GPIO_PinRead(SD315AI_SO1_B_GPIO,SD315AI_SO1_B_PIN)== 1 ||GPIO_PinRead(SD315AI_SO2_B_GPIO,SD315AI_SO2_B_PIN)== 1)
          {
               
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,1);//SD315_VL_B_OUTPUT=0;
            

          }
          else
          {
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,0);//SD315_VL_B_OUTPUT=0;
          }
          /*Check W phase*/
          if(GPIO_PinRead(SD315AI_SO1_C_GPIO,SD315AI_SO1_C_PIN)== 1 || GPIO_PinRead(SD315AI_SO2_C_GPIO,SD315AI_SO2_C_PIN)== 1)
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,1);
               
          }
          else
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,0);
          }
		  xResult = xTaskNotifyWait(0x00000000,      
						            0xFFFFFFFF,      
						            &rlValue,        /* 存储ulNotifiedValue在ulvalue中 */
						            xMaxBlockTime);  /* 最大延迟时间 */
		
		if( xResult == pdPASS )
		{
            ulValue=rlValue;
			printf("vTaskCOTL = %#x\r\n", ulValue);
			/****************digitalkey coder******************/
			 if(ulValue == 0x01)
			 {
                ucKeyCode =ABC_POWER_PRES  ; 
			 }
			 if(ulValue == 0x2)
			 {
                ucKeyCode =START_PRES  ; 
			 }
			 if(ulValue == 0x4)
			 {
                ucKeyCode =DIR_PRES  ; 
			 }
			 if(ulValue == 0x07)
			 {
                ucKeyCode =DIGITAL_ADD_PRES  ; 
			 }
			 if(ulValue == 0x06)
			 {
                ucKeyCode =DIGITAL_REDUCE_PRES  ; 
			 }
			 if(ulValue == 0x09)
			 {
                ucKeyCode =DOOR_PRES ; 
			 }
			 if(ulValue == 0x0a)
			 {
                ucKeyCode =HALL_PRES ; 
			 }
			 if(ulValue == 0x0c)
			 {
                ucKeyCode =WHEEL_PRES ; 
			 }
			  if(ulValue == 0x0e)
			 {
                ucKeyCode =WIPERS_PRES ; 
			 }
			  if(ulValue == 0x12)
			 {
                ucKeyCode =AIR_PRES ; 
			 }
			 
